Revit 2027 API
ExternalResourceUtils Class
 A utility class containing functions related to external resource references.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ExternalResourceUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ExternalResourceUtils
Public NotInheritable Class ExternalResourceUtils
public ref class ExternalResourceUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ExternalResourceUtils = class end
The ExternalResourceUtils type exposes the following members.
Methods
Name | Description
GetAllExternalResourceReferences(Document) |  Gets the ids of all elements which refer to external resources.
GetAllExternalResourceReferences(Document, ExternalResourceType) |  Gets the ids of all elements which refer to a specific type of external resource.
Top
Remarks
 Elements which are external resource references refer to data outside of the base .rvt file. Examples include Revit links and the keynote table data.
See Also
Reference
Autodesk.Revit.DB Namespace